package housePrice;
/*Создайте класс House, который будет представлять дом. Класс должен иметь следующие свойства:
• address (адрес дома),
• numberOfRooms (количество комнат в доме),
• area (площадь дома в квадратных метрах).

Требования:
1. Реализуйте конструктор для инициализации адреса, количества комнат и площади дома.
2. Добавьте методы get и set для каждого из свойств: address, numberOfRooms и area.
3. Реализуйте метод calculatePrice, который будет вычислять стоимость дома. Предположим, что стоимость одного 
   квадратного метра составляет 1500 единиц валюты. Метод должен возвращать общую стоимость дома на основе его площади.
4. Реализуйте метод addRoom, который будет увеличивать количество комнат на заданное число. */
public class House {

}
